# lab_os
## Лабораторная работа №1. Архиватор
### Задание:
1. Написать программу архиватор на языке C. На вход программе-архиватору 
передается папка с файлами, файлы имеют различное расширение, результатом работы 
программы является один файл, объединяющий все файлы из входной директории, а 
также содержащий заголовок с информацией об именах файлов и их размерах. Учесть 
возможность вложенной структуры папок. 
2. Написать программу разархиватор, разделяющий архивированный файл обратно на 
файлы с учетом структуры папок.
### Вариант:
Добавить для архивирования и разархивирования ввод пароля, который будет 
сохраняться в файле-архиве.
### Литература:
Основы программирования в Linux. Автор: Мэтью Нейл, Стоунс Ричард. 
Глава 3. Работа с файлами.
## Лабораторная работа №2. Управление процессом
### Задание:
1. Написать программу «терминал», которая анализирует входную строку и при 
обнаружении ключевых слов «ls», «cat», «nice» и «killall» запускает 
соответствующие процессы.
2. В программе реализовать возможность запуска процессов других программ, 
например, браузера.
3. Написать обработчики сигналов, например, при получении сигнала CTRL+C 
завершить запущенный программой процесс.
4. Заменить системный bash на собственный терминал.
### Вариант:
Программа хранит все открытые процессы. Запустить 3 программы через 
терминал, сигнал CTRL+C должен закрывать программы в 
последовательности FIFO
### Литература:
Основы программирования в Linux. Автор: Мэтью Нейл, Стоунс 
Ричард. Глава 11. Процессы и сигналы.
## Лабораторная работа №3. Межпроцессное взаимодействие (Inter-process communication (IPC))
### Задание:
1.	Написать следующие программы:
Программа 1. Программа читает заданный файл и выводит его содержимое в поток вывода с применение IPC в соответствии с вариантом.
Программа 2. Программа запускает два экземпляра программы 1 и разными исходными файлами осуществляет с выходными данными программ побитовую операцию XOR и сохраняет результат в файл.
2.	Запустить вторую программу и подать на вход текстовый файл и файл, содержащий случайную последовательность.
3.	Запустить вторую программу с файлом, полученным во втором пункте и файлом, содержащим случайную последовательность.
4.	Сравнить текстовый файл до и после шифрования.
### Вариант:
Написать программу, которая создает каналы для обмена данными между процессами.
### Литература:
Основы программирования в Linux. Автор: Мэтью Нейл, Стоунс Ричард. Глава 13. Межпроцессное взаимодействие.
## Лабораторная работа №4. Многопоточность. Pthread.
### Задание:
Многопоточный фильтр Собела. Программа получает фотографию на вход, делится на pthread
и накладывает фильтр Собела. Каждый поток обрабатывает определенное количество строк исходного изображения. Программа фиксирует время своего выполнения.
Запустить программу с 1,2,4,8, 16 и 32 потоками, зафиксировать время выполнения для каждой реализации. Сделать выводы.
### Вариант:
Варианты для всех студентов одинаковы, но желательно выполнять лабораторную работу на разных машинах.
### Пример программы:
Пример программы, реализующей фильтр Собела:
```c
#include <stdio.h>
#include <stdlib.h>
#include <math.h>

// Функция для применения фильтра Собела к изображению
void applySobelFilter(int image[][3], int result[][3]) {
    int gx, gy;
    
    // Ядро фильтра Собела по оси X
    int kernelX[3][3] = {
        {-1, 0, 1},
        {-2, 0, 2},
        {-1, 0, 1}
    };
    
    // Ядро фильтра Собела по оси Y
    int kernelY[3][3] = {
        {1, 2, 1},
        {0, 0, 0},
        {-1, -2, -1}
    };
    
    for (int i = 1; i < 2; i++) {
        for (int j = 1; j < 2; j++) {
            gx = 0;
            gy = 0;
            
            // Применяем ядра фильтра Собела к пикселям изображения
            for (int k = -1; k <= 1; k++) {
                for (int l = -1; l <= 1; l++) {
                    gx += image[i + k][j + l] * kernelX[k + 1][l + 1];
                    gy += image[i + k][j + l] * kernelY[k + 1][l + 1];
                }
            }
            
            // Вычисляем градиент изображения
            result[i][j] = sqrt(gx * gx + gy * gy);
        }
    }
}

int main() {
    int image[3][3] = {
        {10, 20, 30},
        {40, 50, 60},
        {70, 80, 90}
    };
    
    int result[3][3];
    
    applySobelFilter(image, result);
    
    // Выводим результат применения фильтра Собела к изображению
    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 3; j++) {
            printf("%d ", result[i][j]);
        }
        printf("\n");
    }
    
    return 0;
}
```
### Литература:
Основы программирования в Linux. Автор: Мэтью Нейл, Стоунс Ричард. Глава 12. Потоки POSIX.
## Лабораторная работа № 5 Разделение ресурсов. Организация критической секции.
### Задание:
В работе необходимо написать 2 программы для реализации критической секции в соответствии с вариантом задания. Критическую секцию первой программы реализовать на семафорах, а вторую с применением мониторов. Реализовать вывод на экран информации о попытках зайти в критическую секцию, успешном заходе и выходе из критической секции.
### Вариант:
Варианты в словесном описании программы, для которой необходимо реализовать много поточное приложение. Каждый поток реализует одну сущность из предложенного варианта. Все задания можно свести к классическим задачам синхронизации.

Жил-был один человек, и звали его Полуэкт. И было у него две бабушки, одна мама и не менее одной девушки. Человек этот очень любил работать допоздна, а его бабушки, мама и девушки очень волновались, не случилось ли с ним чего-нибудь. И вот каждый вечер все эти мамы, бабушки и девушки начинают друг другу звонить, чтобы узнать, не случилось ли чего-нибудь с Полуэктом. Человек и каждая из мам, бабушек и девушек имеет один телефон и может говорить или ждать звонка (ждать они не любят, а вот говорить очень даже любят). Соединение Полуэкт->(бабушка | мама | девушка) может быть установлено только по звонку Полуэкта. Бабушки прекращают звонить, если они уже переговорили со всеми остальными ожидающими и получили подтверждение хотя бы от одного из них. Полуэкт прекращает звонить после первого успешного соединения. Задача: разработать систему, позволяющую всем бабушкам и т. п. получить подтверждение того, что Полуэкт ещё на работе и что-нибудь с ним ещё не случилось. Информацию может сообщить как сам Полуэкт, так и кто-нибудь из бабушек.
